---
type: ContinuousRailType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 13
tags: [revit-api, class]
---

# ContinuousRailType

`Autodesk.Revit.DB.Architecture.ContinuousRailType` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | DefaultJoinOption | 2013 | `public RailTypeDefaultJoinOption DefaultJoinOption { get ; set ; }` |
| Property | EndOrTopExtensionLength | 2013 | `public double EndOrTopExtensionLength { get ; set ; }` |
| Property | EndOrTopExtensionStyle | 2013 | `public RailExtensionStyle EndOrTopExtensionStyle { get ; set ; }` |
| Property | EndOrTopTermination | 2013 | `public ElementId EndOrTopTermination { get ; set ; }` |
| Property | FilletRadius | 2013 | `public double FilletRadius { get ; set ; }` |
| Property | HandClearance | 2013 | `public double HandClearance { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | ProfileId | 2013 | `public ElementId ProfileId { get ; set ; }` |
| Property | Projection | 2013 | `public double Projection { get ; }` |
| Property | StartOrBottomExtensionLength | 2013 | `public double StartOrBottomExtensionLength { get ; set ; }` |
| Property | StartOrBottomExtensionStyle | 2013 | `public RailExtensionStyle StartOrBottomExtensionStyle { get ; set ; }` |
| Property | StartOrBottomTermination | 2013 | `public ElementId StartOrBottomTermination { get ; set ; }` |
| Property | Transition | 2013 | `public RailTransitionOption Transition { get ; set ; }` |